include "../engine.d"

/** Правила склонения для белорусского языка. */
class WordCaserEngineBy : WordCaserEngine
{
  /// Окончания прилагательных
  static List AdjectiveEnds => ["вы", "кі", "ны", "шы", "ная", "нае"];

  /// Женские фамилии без склонения
  static List IndeclinableSurnames =>
    ["асадчанка", "бандарэнка", "барэйка", "бурэйка", "касцюшка", "удавенка", "уклейка"];

  bool IsExceptionWord(string word)
  {
    word = word.ToLower();
    if (word.EndsWith("ння"))
      return true;
    return base.IsExceptionWord(word);
  }

  string NormalData(string data)
  {
    data = data.Replace("i", "і");
    data = data.Replace("'", "’");
    data = data.Replace("`", "’");
    return data;
  }

  string GetWordForm(string word)
  {
    word = word.ToLower();
    if (AdjectiveEnds.Any(s => word.EndsWith(s)))
      return "a";
    return base.GetWordForm(word);
  }

  string _internalNameCase(int mode, string text, string wCase, bool female)
  {
    if (mode == 1 && female)
    {
      if (text.ToLower() in IndeclinableSurnames)
        return text;
    }
    return base._internalNameCase(mode, text, wCase, female);
  }

  WordCaserEngineBy() : base()
  {
    _exceptionWords = 
    [ 
      "кіраўніка", "мастацтва", 
      "навукі", "навукова", "начальніка",  
      "палітыкі", "паловы", "рэдакцыйна", 
      "сістэм", "справаводства", "супрацоўніцтва", 
      "участка",
      "эканомікі", "энергетыка", // навукова-асветніцкай 
    ];
    _prepositions =
    [
      "з", "са", "пра", "для", "да", "ад", "па", "у", "ў", "аб", "пры", "без",
      "над", "пад", "перад", "праз",
      "по", "с", "со", "в", "во", "на", "о", "об", "от", "до", "к", "ко", "при",
    ];
    _cases = 
    [
      // Мужская фамилия
      ["1m",  "от",   "ата",  "ату",  "ата",  "атом", "ату",  ""],                   // К-от
      ["1m",  "та",   "ты",   "ту",   "ту",   "там",  "ту",   ""],                   // Лапа-та
      ["1m",  "ак",   "ка",   "ку",   "ка",   "кам",  "ку",   "н"],                  // Мацюшон-ак
      ["1m",  "ук",   "ука",  "уку",  "ука",  "уком", "уку",  "ш"],                  // Лаш-ук
      ["1m",  "а",    "у",    "у",    "у",    "ам",   "у",    "г"],                  // Стрыг-а
      ["1m",  "а",    "і",    "у",    "у",    "ам",   "у",    "к"],                  // Цярэшк-а
      ["1m",  "і",    "ага",  "аму",  "ага",  "ім",   "ім",   ""],                   // Пятройск-і
      ["1m",  "й",    "я",    "ю",    "я",    "ём",   "ю",    ""],                   // Буда-й
      ["1m",  "ь",    "я",    "ю",    "я",    "ем",   "ю",    ""],                   // Ведзен-ь
      ["1m",  "ы",    "ага",  "аму",  "ага",  "ым",   "ым",   ""],                   // Шчасн-ы
      ["1m",  "ў",    "ва",   "ву",   "ва",   "вым",  "ву",   ""],                   // Джумако-ў
      ["1m",  "",     "а",    "у",    "а",    "ам",   "у",    "кнсч"],               // Адамовіч, Дзятчык, Лабан, Стурліс
      ["1m",  "",     "а",    "у",    "а",    "ом",   "у",    "ш"],                  // Балыш
      // Женская фамилия
      ["1f",  "іна",  "інай", "інай", "іну",  "інай", "інай", "ц"],                  // Ракуц-іна,
      ["1f",  "ва",   "вай",  "вай",  "ву",   "вай",  "вай",  "аеоэ"],               // Арцем`е-ва, Мартына-ва, Мохарэ-ва, Шаўро-ва 
      ["1f",  "ая",   "ай",   "ай",   "ую",   "ай",   "ай",   ""],                   // Гружэўск-ая
      ["1f",  "ва",   "вы",   "ве",   "ву",   "вай",  "ве",   ""],                   // Гры-ва
      ["1f",  "ка",   "кі",   "цы",   "ку",   "кай",  "цы",   ""],                   // Алексеен-ка
      ["1f",  "та",   "ты",   "це",   "ту",   "тай",  "це",   ""],                   // * Цікота
      ["1f",  "на",   "най",  "най",  "ну",   "най",  "най",  "ы"],                  // Мішы-на
      ["1f",  "на",   "ной",  "ной",  "ну",   "ной",  "ной",  "і"],                  // Бараздзі-на, Фамі-на,
      ["1f",  "я",    "і",    "е",    "ю",    "ей",   "і",    ""],                   // Ляўчэн-я
      // Имя
      ["2m",  "ётр",  "ятра", "ятру", "ятра", "ятром","ятру", ""],                   // П-ётр
      ["2m",  "та",   "ты",   "це",   "ту",   "тай",  "це",   "і"],                  // Мікі-та
      ["2m",  "ў",    "ва",   "ву",   "ва",   "вам",  "ву",   ""],                   // Вячасла-ў
      ["2m",  "й",    "я",    "ю",    "я",    "ем",   "ю",    ""],                   // Геннадзі-й
      ["2m",  "",     "а",    "у",    "а",    "ам",   "у",    "гднрс"],              // Алег, Леонід, Іван, Віктар, Дзяніс
      ["2f",  "га",   "гі",   "зе",   "гу",   "гай",  "зе",   ""],                   // Воль-га
      ["2f",  "ка",   "кі",   "цы",   "ку",   "кай",  "ке",   ""],                   // Анжэлі-ка
      ["2f",  "та",   "ты",   "це",   "ту",   "тай",  "це",   ""],                   // * Лізаве-та
      ["2f",  "а",    "ы",    "ы",    "у",    "ай",   "ы",    "р"],                  // Аляксандр-а
      ["2f",  "а",    "ы",    "зе",   "у",    "ай",   "зе",   "д"],                  // Зінаід-а
      ["2f",  "а",    "ы",    "е",    "у",    "ай",   "е",    "влнс"],               // Ев-а, Ін-а, Людміл-а, Тэрэса
      ["2f",  "я",    "і",    "і",    "ю",    "яй",   "і",    ""],                   // Леакадзі-а
      ["2f",  "ў",    "ві",   "ві",   "ў",    "ўю",   "ві",   ""],                   // Любо-ў
      // Отчество
      ["3m",  "",     "а",    "у",    "а",    "ам",   "у",    "ч"],                  // Часлававіч
      ["3f",  "а",    "ы",    "е",    "у",    "ай",   "е",    ""],                   // Пятроўна

      ["...", "",     "а",    "у",    "а",    "ом",   "у",                           // Ударная 'о' в творительном падеже
                                                              ["сакратар", "кладаўшчык", 
                                                               "кіраўнік", "вартаўнік"] ],       
      ["...", "ая",   "ую",   "ай",   "ую",   "ай",   "ай",                          // Одушевленное существітельное Прыемн-ая маці
                                                              ["прыёмная"] ],       
                                                                         
      // Post (#n / #a)
      ["#n",  "вец",  "ўца",  "ўцу",  "ўца",  "ўцам", "ўцу",  ""],                   // Таваразна-вец   
      ["#n",  "а",    "і",    "у",    "у",    "ам",   "у",    "к"],                  // Бацьк-а 
      ["#n",  "а",    "ы",    "е",    "у",    "ай",   "е",    "впб"],                // Установ-а, Груп-а   
      ["#n",  "а",    "ы",    "ы",    "у",    "ай",   "ы",    "ц"],                  // Прыбіральшчыц-а   
      ["#n",  "е",    "я",    "ю",    "і",    "ем",   "і",    "н"],                  // Упраўленн-е 
      ["#n",  "ь",    "я",    "ю",    "я",    "ем",   "ю",    "лн"],                 // Вадзіцел-ь  
      ["#n",  "ы",    "ага",  "аму",  "ага",  "ым",   "ым",   "ч"],                  // Рабоч-ы   
      ["#n",  "я",    "і",    "і",    "ю",    "ёй",   "і",    "лы"],                 // Бухгалтеры-я   
      ["#n",  "я",    "і",    "і",    "ю",    "яй",   "і",    "н"],                  // Фотамайстэрн-я   
      ["#n",  "",     "а",    "у",    "",     "ам",   "е",    "лм"],                 // Аддзел, Дом  
      ["#n",  "",     "а",    "у",    "а",    "ам",   "у",    "гкрт"],               // Тэхнолаг, Загадчык, Бухгалтар, Спецыяліст  

      ["#a",  "ае",   "ага",  "аму",  "ым",   "ым",   "ым",   "н"],                  // Галоўн-ае
      ["#a",  "ая",   "ай",   "ай",   "ую",   "ай",   "ай",   "нч"],                 // Дзяржаўн-ая, Гаспадарч-ая
      ["#a",  "ы",    "ага",  "аму",  "ага",  "ым",   "ым",   "внрш"],               // Галоўн-ы, Малодш-ы, Навуков-ы   
      ["#a",  "і",    "ага",  "аму",  "і",    "ім",   "ім",   "к"],                  // Выдавецк-і   

      // Агульныя (падраздзяленне, установа, …) — С / П
      ["n",   "вец",  "ўца",  "ўцу",  "ўца",  "ўцам", "ўцу",  ""],                   // Таваразна-вец   
      ["n",   "а",    "і",    "у",    "у",    "ам",   "у",    "к"],                  // …
      ["n",   "а",    "ы",    "е",    "у",    "ай",   "е",    "впб"],                // Установ-а, Груп-а   
      ["n",   "е",    "я",    "ю",    "і",    "ем",   "і",    "н"],                  // Упраўленн-е 
      ["n",   "я",    "і",    "і",    "ю",    "ёй",   "і",    "лы"],                 // Бухгалтеры-я   
      ["n",   "я",    "і",    "і",    "ю",    "яй",   "і",    "н"],                  // Фотамайстэрн-я   
      ["n",   "",     "а",    "у",    "",     "ам",   "е",    "лм"],                 // Аддзел, Дом  
      ["n",   "",     "а",    "у",    "а",    "ам",   "у",    "гкрт"],               // …

      ["a",   "ае",   "ага",  "аму",  "ым",   "ым",   "ым",   "н"],                  // Галоўн-ае
      ["a",   "ая",   "ай",   "ай",   "ую",   "ай",   "ай",   "нч"],                 // Дзяржаўн-ая
      ["a",   "ы",    "ага",  "аму",  "ага",  "ым",   "ым",   "внрш"],               // Навуков-ы   
      ["a",   "і",    "ага",  "аму",  "і",    "ім",   "ім",   "к"],                  // Выдавецк-і   
    ];
  }
}

__wordCaser = new WordCaserEngineBy();
